; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-8-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p2-3 - location
	p3-1 - location
	p3-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s3)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at truck8 s1)
	(empty truck8)
	(at package1 s3)
	(at package2 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s3)
	(at truck1 s2)
	(at truck7 s0)
	(at truck8 s0)
	(at package1 s3)
	(at package2 s3)
	))


)

; plan
1. (board-truck driver1 s1 truck6)
   deleted: (at driver1 s1) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 2 of 9
2. (load-truck s1 package2 truck6)
   deleted: (at package2 s1)
   added: (in package2 truck6)
   goals met: 2 of 9
3. (board-truck driver2 s3 truck1)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 9
4. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 3 of 9
5. (disembark-truck driver2 s2 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 4 of 9
6. (walk driver3 s3 p3-1)
   deleted: (at driver3 s3)
   added: (at driver3 p3-1)
   goals met: 4 of 9
7. (drive-truck driver1 s1 s2 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   goals met: 4 of 9
8. (walk driver3 p3-1 s1)
   deleted: (at driver3 p3-1)
   added: (at driver3 s1)
   goals met: 5 of 9
9. (drive-truck driver1 s2 s3 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   goals met: 5 of 9
10. (unload-truck s3 package2 truck6)
   deleted: (in package2 truck6)
   added: (at package2 s3)
   goals met: 6 of 9
11. (drive-truck driver1 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 6 of 9
12. (disembark-truck driver1 s2 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 7 of 9
13. (board-truck driver3 s1 truck7)
   deleted: (at driver3 s1) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 6 of 9
14. (drive-truck driver3 s1 s0 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 7 of 9
15. (walk driver4 s3 p3-1)
   deleted: (at driver4 s3)
   added: (at driver4 p3-1)
   goals met: 6 of 9
16. (walk driver4 p3-1 s1)
   deleted: (at driver4 p3-1)
   added: (at driver4 s1)
   goals met: 6 of 9
17. (board-truck driver4 s1 truck8)
   deleted: (at driver4 s1) (empty truck8)
   added: (driving driver4 truck8)
   goals met: 6 of 9
18. (drive-truck driver4 s1 s0 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   goals met: 7 of 9
19. (disembark-truck driver3 s0 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s0) (empty truck7)
   goals met: 7 of 9
20. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   goals met: 7 of 9
21. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   goals met: 8 of 9
22. (disembark-truck driver4 s0 truck8)
   deleted: (driving driver4 truck8)
   added: (at driver4 s0) (empty truck8)
   goals met: 8 of 9
23. (board-truck driver4 s0 truck4)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 8 of 9
24. (drive-truck driver4 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 8 of 9
25. (disembark-truck driver4 s3 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s3) (empty truck4)
   goals met: 9 of 9
